{"format": "layers-model", "generatedBy": "keras v2.1.6-tf", "convertedBy": "TensorFlow.js Converter v3.18.0", "modelTopology": {"keras_version": "2.1.6-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"batch_input_shape": [null, 784], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform", "dtype": "float32"}}, "use_bias": true, "activation": "relu", "kernel_regularizer": null, "bias_constraint": null, "name": "dense_2", "units": 64, "kernel_constraint": null, "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform", "dtype": "float32"}}, "use_bias": true, "activation": "softmax", "kernel_regularizer": null, "bias_constraint": null, "name": "dense_3", "units": 10, "kernel_constraint": null, "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}]}, "training_config": {"metrics": ["accuracy"], "loss_weights": null, "loss": "categorical_crossentropy", "optimizer_config": {"class_name": "SGD", "config": {"decay": 0.0, "lr": 0.009999999776482582, "nesterov": false, "momentum": 0.0}}, "sample_weight_mode": null}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense_2/kernel", "shape": [784, 64], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [64, 10], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [10], "dtype": "float32"}]}]}